Revit 2026 API

# SlabShapeCreaseType Enumeration

---

The type of a SlabShapeCrease

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SlabShapeCreaseType
```
```vb
Public Enumeration SlabShapeCreaseType
```
```cpp
public enum class SlabShapeCreaseType
```
```fsharp
type SlabShapeCreaseType
```

| Member name | Value | Description |
| --- | --- | --- |
| Auto | 3 | the crease is automatically generated. |
| Boundary | 1 | The crease is on boundary. |
| Invalid | 0 | The crease is invalid. |
| UserDrawn | 2 | The crease is created by user. |

#### Reference

Autodesk.Revit.DB Namespace